random.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Random</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./style.css" />
<link rel="stylesheet" href="./prism/prism.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Random</h1>
<p class="author">Swami Vivekanand <br> April 2026</p>
<div class="abstract">
  <h2>Abstract</h2>
  <p>Anything i want to test or just put</p>
</div>

<div id="outline-container-orgac620bd" class="outline-2">
<h2 id="orgac620bd">Math with MathJax</h2>
<div class="outline-text-2" id="text-orgac620bd">
<p>
\(y = x^2\)
</p>

<p>
\[
\frac{d}{dx}\left(\int_a^x f(t)\,dt\right) = f(x)
\]
</p>
</div>
</div>

<div id="outline-container-orgbf87de2" class="outline-2">
<h2 id="orgbf87de2">A python code block</h2>
<div class="outline-text-2" id="text-orgbf87de2">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">name</span> = <span style="font-weight: bold;">input</span>(<span style="font-style: italic;">"Who dis? "</span>)
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Wassup"</span>, name)
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Celcius to Kelvin and Farenheit"</span>)
<span style="font-weight: bold; font-style: italic;">celciusinput</span> = <span style="font-weight: bold;">input</span>(<span style="font-style: italic;">"Degree celcius? "</span>)
<span style="font-weight: bold;">try</span>:
    <span style="font-weight: bold; font-style: italic;">celcius</span> = <span style="font-weight: bold;">int</span>(celciusinput)
    <span style="font-weight: bold; font-style: italic;">kelvin</span> = celcius + 273.15
    <span style="font-weight: bold; font-style: italic;">farenheit</span> = celcius * 1.8 + 32
    <span style="font-weight: bold;">print</span>(celcius, <span style="font-style: italic;">"Degree Celcius"</span>, <span style="font-style: italic;">"="</span>, kelvin, <span style="font-style: italic;">"Kelvin"</span>)
    <span style="font-weight: bold;">print</span>(celcius, <span style="font-style: italic;">"Degree Celcius"</span>, <span style="font-style: italic;">"="</span>, farenheit, <span style="font-style: italic;">"Farenheit"</span>)
    <span style="font-weight: bold;">if</span> celcius &lt; 5:
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Sheeesh, that`s so cold"</span>, name, <span style="font-style: italic;">"!"</span>)
    <span style="font-weight: bold;">if</span> celcius &gt; 50:
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"You wanna burn urself or whut"</span>, name, <span style="font-style: italic;">"!"</span>)
        <span style="font-weight: bold;">if</span> celcius == 69:
            <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"NICE"</span>)
<span style="font-weight: bold;">except</span>:
    <span style="font-weight: bold;">print</span>(
        <span style="font-style: italic;">"Since when did"</span>,
        celciusinput,
        <span style="font-style: italic;">"become temperature nigga! Write the digits"</span>,
        name,
    )
</pre>
</div>
</div>
</div>

<div id="outline-container-org5860cd3" class="outline-2">
<h2 id="org5860cd3">A quote</h2>
<div class="outline-text-2" id="text-org5860cd3">
<blockquote>
<p>
He who writes most meaningless thing shall fill this quote box.
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
